{"format": "graph-model", "generatedBy": "2.16.1", "convertedBy": "TensorFlow.js Converter v4.19.0", "signature": {"inputs": {"xs_0": {"name": "xs_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "3"}]}}}, "outputs": {"Identity_2:0": {"name": "Identity_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "10"}]}}, "out": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "5"}]}}, "Identity_1:0": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "10"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/jax2tf_arg_3/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "5"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/Dummy/pjit_silu_/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "xs_0", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "2"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/Dummy/Dense_0/MatMul", "op": "MatMul", "input": ["xs_0", "StatefulPartitionedCall/jax2tf_arg_1/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"grad_a": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "Identity_1", "op": "Identity", "input": ["StatefulPartitionedCall/jax2tf_apply_/Dummy/Dense_0/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/Dummy/pjit_silu_/Neg", "op": "Neg", "input": ["StatefulPartitionedCall/jax2tf_apply_/Dummy/Dense_0/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/Dummy/pjit_silu_/Exp", "op": "Exp", "input": ["StatefulPartitionedCall/jax2tf_apply_/Dummy/pjit_silu_/Neg"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/Dummy/pjit_silu_/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/Dummy/pjit_silu_/Const", "StatefulPartitionedCall/jax2tf_apply_/Dummy/pjit_silu_/Exp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/Dummy/pjit_silu_/truediv", "op": "Reciprocal", "input": ["StatefulPartitionedCall/jax2tf_apply_/Dummy/pjit_silu_/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/Dummy/pjit_silu_/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_apply_/Dummy/Dense_0/MatMul", "StatefulPartitionedCall/jax2tf_apply_/Dummy/pjit_silu_/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/Dummy/Dense_1/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/jax2tf_apply_/Dummy/pjit_silu_/Mul", "StatefulPartitionedCall/jax2tf_arg_3/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"grad_a": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "Identity_2", "op": "Identity", "input": ["StatefulPartitionedCall/jax2tf_apply_/Dummy/pjit_silu_/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/jax2tf_apply_/Dummy/Dense_1/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1766}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/jax2tf_arg_3/ReadVariableOp", "shape": [10, 5], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_apply_/Dummy/pjit_silu_/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_arg_1/ReadVariableOp", "shape": [3, 10], "dtype": "float32"}]}]}